In [1]:
import pandas as pd

In [2]:
dict={'City':['Ahmedabad','Baroda','Anand','Ahmedabad','Baroda','Anand'],
     'Temp':[40,35,32,45,37,34],
     'Humidity':[32,34,23,24,27,32]}
data=pd.DataFrame(dict)
data

        City  Temp  Humidity
0  Ahmedabad    40        32
1     Baroda    35        34
2      Anand    32        23
3  Ahmedabad    45        24
4     Baroda    37        27
5      Anand    34        32

# 1. Display Average Temperature.

In [3]:
data['Temp'].mean()

37.166666666666664

# 2. Display Average Temperature CityWise.

In [5]:
grp=data.groupby('City')['Temp'].mean()
grp

City
Ahmedabad    42.5
Anand        33.0
Baroda       36.0
Name: Temp, dtype: float64

# 3. Display All The Groups [ Iterate Over The Groups ].

In [6]:
grp=data.groupby('City')
grp  ## data frame's groupby object is created

In [7]:
for key,value in grp:
    print(key)
    print(value)

Ahmedabad
        City  Temp  Humidity
0  Ahmedabad    40        32
3  Ahmedabad    45        24
Anand
    City  Temp  Humidity
2  Anand    32        23
5  Anand    34        32
Baroda
     City  Temp  Humidity
1  Baroda    35        34
4  Baroda    37        27

# 4. Display The Indices In Each Group.

In [8]:
## groups is attribute of grp objects, groups is not a method
grp.groups

{'Ahmedabad': [0, 3], 'Anand': [2, 5], 'Baroda': [1, 4]}

# 5. Display The First Entry In All The Groups Formed.

In [11]:
grp=data.groupby('City')
grp

In [12]:
grp.first()

           Temp  Humidity
City
Ahmedabad    40        32
Anand        32        23
Baroda       35        34

In [13]:
grp.last()

           Temp  Humidity
City
Ahmedabad    45        24
Anand        34        32
Baroda       37        27

# 6. Count The Number of Entries In Each Group.

In [15]:
grp.size()

City
Ahmedabad    2
Anand        2
Baroda       2
dtype: int64

# 7. Display A Specific Group Out of All The Groups.

In [17]:
grp = data.groupby('City')
grp.get_group('Ahmedabad')

        City  Temp  Humidity
0  Ahmedabad    40        32
3  Ahmedabad    45        24

In [18]:
## similarly
grp.get_group('Anand')

    City  Temp  Humidity
2  Anand    32        23
5  Anand    34        32

# 8. Apply Functions To Groupby Groups [ Like min, max and mean, etc.].

In [19]:
grp=data.groupby('City')
grp

In [20]:
grp.mean()

           Temp  Humidity
City
Ahmedabad  42.5      28.0
Anand      33.0      27.5
Baroda     36.0      30.5

In [22]:
grp=data.groupby('City').mean()
grp

           Temp  Humidity
City
Ahmedabad  42.5      28.0
Anand      33.0      27.5
Baroda     36.0      30.5

In [23]:
grp=data.groupby('City').min()
grp

           Temp  Humidity
City
Ahmedabad    40        24
Anand        32        23
Baroda       35        27

In [24]:
grp=data.groupby('City')['Temp'].mean()
grp

City
Ahmedabad    42.5
Anand        33.0
Baroda       36.0
Name: Temp, dtype: float64

# 9. Display Average Temperature CityWise With Prefix Mean_Temp_.

In [28]:
## add prefix method to add prefix infront of values of City column
grp=data.groupby('City')['Temp']\
.mean().add_prefix('Avg_Temp_')
grp

City
Avg_Temp_Ahmedabad    42.5
Avg_Temp_Anand        33.0
Avg_Temp_Baroda       36.0
Name: Temp, dtype: float64

# 10. Display Descriptive Statistics GroupWise.

In [29]:
grp= data.groupby('City')
grp.describe()

           Temp                                                 Humidity  \
          count  mean       std   min    25%   50%    75%   max    count
City
Ahmedabad   2.0  42.5  3.535534  40.0  41.25  42.5  43.75  45.0      2.0
Anand       2.0  33.0  1.414214  32.0  32.50  33.0  33.50  34.0      2.0
Baroda      2.0  36.0  1.414214  35.0  35.50  36.0  36.50  37.0      2.0


           mean       std   min    25%   50%    75%   max
City
Ahmedabad  28.0  5.656854  24.0  26.00  28.0  30.00  32.0
Anand      27.5  6.363961  23.0  25.25  27.5  29.75  32.0
Baroda     30.5  4.949747  27.0  28.75  30.5  32.25  34.0

# 11. Perform Statistical Computations Using agg() Function.

In [30]:
grp=data.groupby('City')
grp.agg(['min','max','mean'])

          Temp           Humidity
           min max  mean      min max  mean
City
Ahmedabad   40  45  42.5       24  32  28.0
Anand       32  34  33.0       23  32  27.5
Baroda      35  37  36.0       27  34  30.5

In [32]:
# computation can be done with one line 
grp=data.groupby('City').agg(['min','max','mean'])
grp

          Temp           Humidity
           min max  mean      min max  mean
City
Ahmedabad   40  45  42.5       24  32  28.0
Anand       32  34  33.0       23  32  27.5
Baroda      35  37  36.0       27  34  30.5

In [33]:
grp=data.groupby('City')['Temp'].agg(['min','max','mean'])
grp

           min  max  mean
City
Ahmedabad   40   45  42.5
Anand       32   34  33.0
Baroda      35   37  36.0

# 12. Create A Function To Get The Statistics GroupWise.

In [34]:
def fun(grp):
    return {'Min':grp.min(),'Mean':grp.mean()}

In [35]:
grp = data.groupby('City').apply(fun)

C:\Users\Dell\AppData\Local\Temp\ipykernel_12512\2830381116.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return {'Min':grp.min(),'Mean':grp.mean()}

In [36]:
grp

City
Ahmedabad    {'Min': ['Ahmedabad', 40, 24], 'Mean': [42.5, ...
Anand         {'Min': ['Anand', 32, 23], 'Mean': [33.0, 27.5]}
Baroda       {'Min': ['Baroda', 35, 27], 'Mean': [36.0, 30.5]}
dtype: object

In [37]:
# ***first grouping base on City and within each City we are grouping base on Temp
grp=data.groupby(['City','Temp'])
grp

In [38]:
for key,value in grp:
    print (key)
    print (value)

('Ahmedabad', 40)
        City  Temp  Humidity
0  Ahmedabad    40        32
('Ahmedabad', 45)
        City  Temp  Humidity
3  Ahmedabad    45        24
('Anand', 32)
    City  Temp  Humidity
2  Anand    32        23
('Anand', 34)
    City  Temp  Humidity
5  Anand    34        32
('Baroda', 35)
     City  Temp  Humidity
1  Baroda    35        34
('Baroda', 37)
     City  Temp  Humidity
4  Baroda    37        27